app/controllers/posts_controller.rb

  def create
    @post = Post.new(content: params[:content])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "A"], ["created_at", "2020-12-16 14:55:12.397058"], ["updated_at", "2020-12-16 14:55:12.397058"]]

  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "機能最終テスト"], ["updated_at", "2020-12-16 14:55:36.090529"], ["id", 2]]

  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 9]]